{
  "film_id": 293442,
  "imdb_id": 293429,
  "imdb_title_id": "tt0293429",
  "film_name": "Mortal Kombat",
  "other_titles": None,
  "version_type": "Standard",
  "images": {
    "poster": {
      "1": {
        "image_orientation": "portrait",
        "region": "global",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442h1.jpg",
          "width": 200,
          "height": 300
        }
      }
    },
    "still": {
      "1": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442h2.jpg",
          "width": 300,
          "height": 200
        }
      },
      "2": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442h3.jpg",
          "width": 300,
          "height": 200
        }
      },
      "3": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442h4.jpg",
          "width": 300,
          "height": 200
        }
      },
      "4": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442h5.jpg",
          "width": 300,
          "height": 200
        }
      },
      "5": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442h6.jpg",
          "width": 300,
          "height": 200
        }
      },
      "6": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442h7.jpg",
          "width": 300,
          "height": 200
        }
      },
      "7": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442h8.jpg",
          "width": 300,
          "height": 200
        }
      },
      "8": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442h9.jpg",
          "width": 300,
          "height": 200
        }
      },
      "9": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442ha.jpg",
          "width": 300,
          "height": 200
        }
      },
      "10": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442hb.jpg",
          "width": 300,
          "height": 200
        }
      },
      "11": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442hc.jpg",
          "width": 300,
          "height": 200
        }
      },
      "12": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442hd.jpg",
          "width": 300,
          "height": 200
        }
      },
      "13": {
        "image_orientation": "landscape",
        "medium": {
          "film_image": "https://image.movieglu.com/293442/293442he.jpg",
          "width": 300,
          "height": 200
        }
      }
    }
  },
  "synopsis_long": "In "Mortal Kombat," MMA fighter Cole Young, accustomed to taking a beating for money, is unaware of his heritage\x97or why Outworld\"s Emperor Shang Tsung has sent his best warrior, Sub-Zero, an otherworldly Cryomancer, to hunt Cole down.  Fearing for his family\"s safety, Cole goes in search of Sonya Blade at the direction of Jax, a Special Forces Major who bears the same strange dragon marking Cole was born with.  Soon, he finds himself at the temple of Lord Raiden, an Elder God and the protector of Earthrealm, who grants sanctuary to those who bear the mark.  Here, Cole trains with experienced warriors Liu Kang, Kung Lao and rogue mercenary Kano, as he prepares to stand with Earth\"s greatest champions against the enemies of Outworld in a high stakes battle for the universe.  But will Cole be pushed hard enough to unlock his arcana\x97the immense power from within his soul - in time to save not only his family, but to stop Outworld once and for all?",
  "distributor_id": 4,
  "distributor": "Warner Bros.",
  "release_dates": [
    {
      "release_date": "2021-04-23",
      "notes": "Nationwide"
    }
  ],
  "age_rating": [
    {
      "rating": "R ",
      "age_rating_image": "https://assets.movieglu.com/age_rating_logos/us/r.png",
      "age_advisory": "for strong bloody violence and language throughout, and some crude references."
    }
  ],
  "duration_mins": 110,
  "review_stars": 2,
  "review_txt": "Mortal Kombat was made with fans in mind and, as such, it has little time or patience with those who come to it without the prerequisite background. 40% fight scenes and 60% fan service, Simon McQuiod\"s slash-and-gore fest will leave the uninitiated scratching their heads while the die-hards jump to their feet and applaud. It\"s that kind of movie and, for those who have spent hours upon hours playing the game and immersing themselves in the lore of the background narrative, Mortal Kombat may seem like a reward. For everyone else, however, if may be more of a penance.\n\nThe movie opens with a respectable and promising prologue. Set in 1617, it provides background for the characters of Scorpion (Hiroyuki Sanada) and his arch-rival, Sub-Zero (Joe Taslim). In addition to an impressive fight, it also (shockingly) kills off a young child. After the opening credits, however, the action shifts to the modern day and all pretense of storytelling and world-building goes out the window. At this point, viewers are expected to rely on their previous Mortal Kombat knowledge to fill in the blanks - which is a distinct problem if you don\"t have any such previous knowledge. \n\nDirector Simon McQuoid probably loves the game. This is the kind of movie one would expect from a fan. The battles are bloody and McQuoid rightly recognizes that many Mortal Kombat players are less interested in providing the characters with credible motivations for their actions than in seeing how their super-powers play out on screen and enjoying the marquee confrontations, many of which end with supremely gory climaxes. However, although the fights are competently choreographed, there\"s a little too much editing room chicanery to make them truly satisfying. And, in terms of pure kinetic action, they pale in comparison to the hyperactive slaughter in the John Wick movies. As for the guy who gets his head squished - that\"s only going to shock someone who didn\"t watch HBO\"s Game of Thrones. \n\n"Mortal Kombat" refers to a tournament in which the heroes of Earth face off against the top fighters of Outworld. Outworld is on a winning streak, having won its last nine bouts. A win against Earth would give the soul-sucking leader, Shang Tsung (Chin Han), total victory and the ability to enslave all humans. His underlings include the aforementioned Sub-Zero alongside the treacherous Kano (Josh Lawson) and a few other thinly-developed creatures. Humanity is represented by MMA fighter Cole Young (Lewis Tan, channeling Steven Seagal\"s woodenness), Sonya Blade (Jessica McNamee), Jax (Mehcad Brooks), Liu Kang (Ludi Lin), and Kung Lao (Max Huang). They are mentored by Lord Raiden (Tadanobu Asano), the "protector of Earth" who, like Marvel\"s The Watcher, isn\"t allowed to interfere. The majority of the movie (at least following the perfunctory introduction of the characters) is spent on various one-on-one duels that inevitably lead to a bigger match or two. \n\nThis isn\"t the first time Mortal Kombat has made it to the big screen. It\"s a testimony to the enduring popularity of the franchise that it survived the rather laughable 1995 film (and its dreadful sequel) and earned this reboot. The 2021 Mortal Kombat does not offer a continuation of the aborted storyline of the earlier productions - this is a wipe-the-slate-clean restart and is designed as the first of a new line of films (with the final scene telegraphing a likely direction for a sequel). \n\nLike nearly all movies based on video games, this one fails to resolve the conflict of whether it\"s being made to satisfy its (smaller) core audience or expand to a (larger) mainstream crowd. By tilting toward the former, McQuoid has largely ignored the latter, which may hurt the film\"s prospects. And, although the overt violence of the fight scenes will be seen as a plus for most die-hard gamers, it may prove to be a turn-off for those who prefer less ostentatious bloodletting. Mortal Kombat is slickly made but hollow, offering little to anyone who isn\"t deeply invested in the franchise. It may be a good tie-in to the video game series but it\"s a bad motion picture.\n\n© 2021 James Berardinelli",
  "trailers": {
    "high": [
      {
        "film_trailer": "https://trailer.movieglu.com/293442_high_V2.mp4",
        "trailer_image": "https://image.movieglu.com/293442/293442h4.jpg",
        "version": 2,
        "quality": "high",
        "region": "US"
      },
      {
        "film_trailer": "https://trailer.movieglu.com/293442_high.mp4",
        "trailer_image": "https://image.movieglu.com/293442/293442h3.jpg",
        "version": 1,
        "quality": "high",
        "region": "US"
      }
    ]
  },
  "genres": [
    {
      "genre_id": 5,
      "genre_name": "Action/Adventure"
    }
  ],
  "cast": [
    {
      "cast_id": 45877,
      "cast_name": "Lewis Tan"
    },
    {
      "cast_id": 4370,
      "cast_name": "Jessica McNamee"
    },
    {
      "cast_id": 45878,
      "cast_name": "Josh Lawson"
    },
    {
      "cast_id": 1735,
      "cast_name": "Tadanobu Asano"
    },
    {
      "cast_id": 4885,
      "cast_name": "Mehcad Brooks"
    },
    {
      "cast_id": 44064,
      "cast_name": "Ludi Lin"
    },
    {
      "cast_id": 43710,
      "cast_name": "Chin Han"
    },
    {
      "cast_id": 45996,
      "cast_name": "Joe Taslim"
    },
    {
      "cast_id": 24909,
      "cast_name": "Hiroyuki Sanada"
    }
  ],
  "directors": [
    {
      "director_id": 11570,
      "director_name": "Simon McQuoid"
    }
  ],
  "producers": [
    {
      "producer_id": 2505,
      "producer_name": "Todd Garner"
    },
    {
      "producer_id": 4529,
      "producer_name": "James Wan"
    }
  ],
  "writers": [
    {
      "writer_id": 13838,
      "writer_name": "Greg Russo"
    }
  ],
  "show_dates": [
    {
      "date": "2021-05-02"
    },
    {
      "date": "2021-05-03"
    },
    {
      "date": "2021-05-04"
    },
    {
      "date": "2021-05-05"
    },
    {
      "date": "2021-05-06"
    },
    {
      "date": "2021-05-07"
    },
    {
      "date": "2021-05-08"
    },
    {
      "date": "2021-05-09"
    },
    {
      "date": "2021-05-10"
    },
    {
      "date": "2021-05-11"
    },
    {
      "date": "2021-05-12"
    },
    {
      "date": "2021-05-13"
    },
    {
      "date": "2021-05-14"
    },
    {
      "date": "2021-05-15"
    },
    {
      "date": "2021-05-16"
    },
    {
      "date": "2021-05-17"
    },
    {
      "date": "2021-05-18"
    },
    {
      "date": "2021-05-19"
    },
    {
      "date": "2021-05-20"
    },
    {
      "date": "2021-05-21"
    },
    {
      "date": "2021-05-22"
    },
    {
      "date": "2021-05-23"
    },
    {
      "date": "2021-05-25"
    },
    {
      "date": "2021-05-27"
    },
    {
      "date": "2021-09-01"
    }
  ],
  "alternate_versions": [
    {
      "film_id": 315350,
      "film_name": "Mortal Kombat: The IMAX 2D Experience",
      "version_type": "IMAX"
    }
  ],
  "status": {
    "count": 1,
    "state": "OK",
    "method": "filmDetails",
    "message": None,
    "request_method": "GET",
    "version": "NONE_66v200",
    "territory": "US",
    "device_datetime_sent": "2021-05-02T03:31:53.839037",
    "device_datetime_used": "2021-05-02 03:31:53"
  }
}