[{"filmSynop": "As the Third Reich continues its reign of terror, Adolf Hitler is on a quest for the legendary Ark os the Covenenant- resting place of the Ten Commandments- whose supernatural powers, legend says, can wipe out entire armies.\n\nThe U.S. Government turns to Dr. Indiana Jones, for the mission.  Relentlessly pursued by Hitler's henchmen, Indy infiltrartes their massive digging operation in a race against time to discover the Well od the Souls, where the Ark has lain undisturbed for centuries.", "filmName": "Raiders of the Lost Ark", "releaseDate": "1992-07-01", "filmRating": "PG ", "filmID": 7772, "movieRating": "0/5", "movieGenre": "Action/Adventure", "movieRuntime": 105, "movieImage": "https://image.movieglu.com/7772/GBR_007772h0.jpg"}, {"filmSynop": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive. Millions of miles away, NASA and a team of international scientists work tirelessly to bring \"the Martian\" home, while his crewmates concurrently plot a daring, if not impossible, rescue mission. As these stories of incredible bravery unfold, the world comes together to root for Watney's safe return.", "filmName": "The Martian", "releaseDate": "2015-09-30", "filmRating": "12A ", "filmID": 184126, "movieRating": "3.5/5", "movieGenre": "Action/Adventure", "movieRuntime": 141, "movieImage": "https://image.movieglu.com/184126/GBR_184126h0.jpg"}, {"filmSynop": "Set on the incendiary frontier of California's turn-of-the-century petroleum boom, the story chronicles the rise of Daniel Plainview, who transforms himself from a down-and-out silver miner raising a son on his own into a self-made oil tycoon. When Plainview gets a mysterious tip that there's a little town out West where an ocean of oil is oozing out of the ground, he heads with his son, H.W., to take their chances in dust-worn Little Boston. In this hardscrabble town, where the main excitement centers around the holy-roller church of charismatic preacher Eli Sunday, Plainview and H.W. make their lucky strike. But even as the well raises all of their fortunes, nothing will remain the same as conflicts escalate and every human value--love, hope, community, belief, ambition and even the bond between father and son--is imperiled by corruption, deception and the flow of oil.", "filmName": "There Will Be Blood", "releaseDate": "2008-02-08", "filmRating": "15 ", "filmID": 59906, "movieRating": "4/5", "movieGenre": "Drama", "movieRuntime": 158, "movieImage": "https://image.movieglu.com/59906/059906h1.jpg"}, {"filmSynop": "In this action-horror flick from director Robert Rodriguez and screenwriter Quentin Tarantino, Tarantino stars with George Clooney as a pair of bad-to-the-bone brothers named Seth and Richie Gecko. After a string of robberies that left a river of blood in the Geckos' wake, the sadistic siblings head to Mexico to live the good life. To get over the border, they kidnap Jacob Fuller, a widowed preacher played by Harvey Keitel, and his two children, Kate (Juliette Lewis) and Scott (Ernest Liu). Once south of the border, the quintet park their RV at a rough-and-tumble trucker bar called The Titty Twister, where Seth and Richie are supposed to meet a local thug. After a couple of drinks, they realize that they're not in a typical bar, as the entire place begins to teem with vicious, blood-sucking vampires. With the odds stacked greatly against them, the Fullers and Geckos team together in hopes of defeating the creatures of the night. Makeup artist Tom Savini and blaxploitation star Fred Williamson appear as allies against the vampires, and Cheech Marin fills three different roles.~ Matthew Tobey, All Movie Guide", "filmName": "From Dusk Till Dawn", "releaseDate": "1996-05-09", "filmRating": "18 ", "filmID": 3427, "movieRating": "0/5", "movieGenre": "Suspense/Thriller", "movieRuntime": 100, "movieImage": "https://image.movieglu.com/3427/GBR_003427h0.jpg"}, {"filmSynop": "Two drag-queens, Mitzi and Felicia, and a transsexual, Bernadette sign up for a gig at a drag show in the remote Australian desert.They head west from Sydney aboard a lavender bus named Priscilla, but when they arrive, they find more than just a cabaret job lying in wait.", "filmName": "The Adventures of Priscilla, Queen of the Desert", "releaseDate": "2019-06-07", "filmRating": "15 ", "filmID": 1685, "movieRating": "0/5", "movieGenre": "Drama", "movieRuntime": 102, "movieImage": "https://image.movieglu.com/1685/GBR_001685h0.jpg"}, {"filmSynop": "This lucrative, elephantine-budgeted sci-fi opus paved the way for director Roland Emmerich's mega-hit Independence Day (1996). The story commences in Giza, Egypt, circa 1928, where an archaeological expedition unearths an ancient ring with cryptic hieroglyphs. The film then moves to the present day, where Egyptologist Daniel Jackson (James Spader) is busily trying to convince a group of skeptics that the pyramids were not built by man, but by an extraterrestrial force. After the lecture, a military man approaches him and offers him a job translating the said ring; its inscriptions actually constitute a map to a massive stargate (or interstellar portal). The army sends over resident crackpot colonel Jack O'Neill (Kurt Russell) to travel through the stargate and see what's on the other side; Jackson accompanies him, and the two men turn up in a desert planet on the other side of the universe, with three moons in its sky. The world in question is ruled by Ra (Jaye Davidson), a hermaphroditic Egyptian sun god, who oppresses hordes of slave workers. Jackson and O'Neill then join forces to help the said workers revolt against their oppressor.~ Paul Brenner, All Movie Guide", "filmName": "Stargate", "releaseDate": "2001-09-26", "filmRating": "PG ", "filmID": 25, "movieRating": "0/5", "movieGenre": "SciFi/Fantasy", "movieRuntime": 116, "movieImage": "https://image.movieglu.com/25/000025h1.jpg"}, {"filmSynop": "Anthony Minghella wrote and directed this award-winning adaptation of Michael Ondaatje's novel about a doomed and tragic romance set against the backdrop of World War II. In a field hospital in Italy, Hana (Juliette Binoche), a nurse from Canada, is caring for a pilot who was horribly burned in a plane wreck; he has no identification and cannot remember his name, so he's known simply as the English Patient, thanks to his accent. When the hospital is forced to evacuate, Hana determines en route that the patient shouldn't be moved far due to his fragile condition, so the two are left in a monastery to be picked up later. In time, Hana begins to piece together the patient's story from the shards of his memories; he's actually Count Laszlo Almasy (Ralph Fiennes), of Hungarian nobility and an explorer working with a group mapping uncharted territory in North Africa. An Englishman, Geoffrey Clifton (Colin Firth), soon joins Almasy's team; travelling with him is his lovely and spirited wife, Katherine (Kristin Scott Thomas). Katherine and Laszlo soon fall in love, which leads Laszlo to betray his friend, his country and all that is dear to him. Meanwhile, Hana and the Patient are joined by Kip (Naveen Andrews), a Sikh with a gift for defusing mines, and Caravaggio (Willem Dafoe), an intelligence agent who knows some of Laszlo's most shameful secrets. The English Patient won nine Academy Awards, including Best Picture, Best Director and Best Supporting Actress (Juliette Binoche).~ Mark Deming, All Movie Guide", "filmName": "The English Patient", "releaseDate": "1997-03-14", "filmRating": "15 ", "filmID": 6650, "movieRating": "0/5", "movieGenre": "Drama", "movieRuntime": 160, "movieImage": "https://image.movieglu.com/6650/006650h1.jpg"}, {"filmSynop": "When entomologist Jumpei (Eiji Okada) travels to sand dunes on an expedition, he is met by a group of people who offer him a place to spend the night. They soon lead him to a house at the bottom of a sandpit. Upon climbing into the pit, he finds a young widow (Kyoko Kishida) living alone. Placed there by the villagers, her task is to dig sand out of the pit -- not only so that they can avoid getting buried, but so that the locals can use it for construction. The next morning, when Jumpei attempts to leave, he finds that the ladder which brought him into the pit is no longer there and the villagers inform him that he must stay and help the woman dig. After trying to get out of the pit, Jumpei takes his anger out on the woman--only to soon become her lover. After some time, he slowly gives in to accepting his predicament. This interesting story takes a simple yet effective route in philosophical allegory, focusing upon the couple's oppressive confinement and the force of their physical attraction to each other in spite of--or because of--their situation. Taken from the novel by Kobo Abe, director/producer Hiroshi Teshigahara completed this visually stunning feature on a budget of only $100,000. Winning a Special Jury Prize at Cannes in 1964, the poetic Woman in the Dunes would go on to be nominated for two Academy Awards: Best Foreign Film (1964) and Best Director (1965).~ Kristie Hassen, All Movie Guide", "filmName": "Woman in the Dunes", "releaseDate": "2021-05-01", "filmRating": "15 ", "filmID": 4167, "movieRating": "0/5", "movieGenre": "Drama", "movieRuntime": 123, "movieImage": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/105/089/datas/original.jpg"}, {"filmSynop": "Stunning in scope, visually magnificent, and filled with compelling performances, David Lean's epic masterpiece is one of the great achievements in cinematic history. Peter O'Toole stars as T.E. Lawrence, a British officer who is sent to Arabia in 1917, and becomes a heroic leader in the Arabic rebellion against the Turks. As he grows more integrated into Arab society, his loyalties become conflicted. Omar Sharif, Alec Guinness and Anthony Quinn co-star in this sweeping historical action-adventure classic.", "filmName": "Lawrence Of Arabia - 70mm", "releaseDate": "2017-09-22", "filmRating": "PG ", "filmID": 8675, "movieRating": "0/5", "movieGenre": "Action/Adventure", "movieRuntime": 222, "movieImage": "https://image.movieglu.com/8675/GBR_008675h0.jpg"}, {"filmSynop": "The Gulf War is over, and three soldiers want to go home rich. Major Archie Gates retires in two weeks.  Sergeant Troy Barlow is a new father.  Chief Elgin is on a four-month paid vacation from Detroit.  Saddam Hussein stole a great deal of gold from Kuwait, and these soldiers have no problem with stealing it from him.  But on their way to collect their booty, they bear witness to the the disturbing results of the war effort.  President Bush has encouraged Iraqi citizens to fight back against Saddam and pledged to support them, but when they rise up, they get NO American support, and they're getting slaughtered.  As the soldiers realize the true situation in Iraq, they're confronted with their own humanity, and they're forced to rethink who they are and what they're doing.", "filmName": "Three Kings", "releaseDate": "1999-11-09", "filmRating": "15 ", "filmID": 21448, "movieRating": "0/5", "movieGenre": "Drama", "movieRuntime": 125, "movieImage": "https://image.movieglu.com/21448/021448h1.jpg"}]