[{"filmSynop": "In \"Mortal Kombat,\" MMA fighter Cole Young, accustomed to taking a beating for money, is unaware of his heritage\u0097or why Outworld's Emperor Shang Tsung has sent his best warrior, Sub-Zero, an otherworldly Cryomancer, to hunt Cole down.  Fearing for his family's safety, Cole goes in search of Sonya Blade at the direction of Jax, a Special Forces Major who bears the same strange dragon marking Cole was born with.  Soon, he finds himself at the temple of Lord Raiden, an Elder God and the protector of Earthrealm, who grants sanctuary to those who bear the mark.  Here, Cole trains with experienced warriors Liu Kang, Kung Lao and rogue mercenary Kano, as he prepares to stand with Earth's greatest champions against the enemies of Outworld in a high stakes battle for the universe.  But will Cole be pushed hard enough to unlock his arcana\u0097the immense power from within his soul - in time to save not only his family, but to stop Outworld once and for all?", "filmName": "Mortal Kombat", "releaseDate": "2021-04-23", "filmRating": "R ", "filmID": 293442, "movieRating": "2/5", "movieGenre": "Action/Adventure", "movieRuntime": 110, "movieImage": "https://image.movieglu.com/293442/293442h1.jpg"}, {"filmSynop": "Set after the events of the television series, Demon Slayer -Kimetsu no Yaiba- The Movie: Mugen Train has Tanjiro, Nezuko, Zenitsu, and Inosuke embark on a new mission. Together with one of the most powerful swordsmen of the Demon Slayer Corps, Flame Hashira Kyojuro Rengoku, they investigate the mysterious disappearance of over 40 people aboard the Mugen Train.", "filmName": "Demon Slayer  - Kimetsu no Yaiba - The Movie: Mugen Train", "releaseDate": "2021-04-23", "filmRating": "R ", "filmID": 311216, "movieRating": "0/5", "movieGenre": "Animation", "movieRuntime": 117, "movieImage": "https://image.movieglu.com/311216/311216h1.jpg"}, {"filmSynop": "In a time when monsters walk the Earth, humanity's fight for its future sets Godzilla and Kong on a collision course that will see the two most powerful forces of nature on the planet collide in a spectacular battle for the ages. As Monarch embarks on a perilous mission into uncharted terrain and unearths clues to the Titans' origins, a human conspiracy threatens to wipe the creatures, both good and bad, from the face of the earth forever.", "filmName": "Godzilla vs Kong", "releaseDate": "2021-03-31", "filmRating": "PG-13 ", "filmID": 220241, "movieRating": "2/5", "movieGenre": "SciFi/Fantasy", "movieRuntime": 113, "movieImage": "https://image.movieglu.com/220241/220241h1.jpg"}, {"filmSynop": "8-year-old Jenny (Violet McGraw) is constantly caught in the middle of the feuding between her lawyer mother Maggie (Mamie Gummer) and artist father Jeff (Rupert Friend). She leads a lonely but imaginative life, surrounded by puppets called \"Grisly Kin\", which are based on the works of her father. When Maggie is tragically killed in a hit-and-run, Jeff and Jenny try to piece together a new life. But when Maggie's father (Brian Cox) sues for custody, and babysitter Samantha (Madeline Brewer) tries to be the new woman of the house, life in their Brooklyn townhome takes a dark turn. The puppets and frightening characters come to life and Jenny is the only person who can see them. When the motives of the ghoulish creatures become clear, the lives of everyone are put very much in jeopardy.", "filmName": "Separation", "releaseDate": "2021-04-30", "filmRating": "R ", "filmID": 316882, "movieRating": "0/5", "movieGenre": "Horror", "movieRuntime": 107, "movieImage": "https://image.movieglu.com/316882/316882h1.jpg"}, {"filmSynop": "Long ago, in the fantasy world of Kumandra, humans and dragons lived together in harmony. But when sinister monsters known as the Druun threatened the land, the dragons sacrificed themselves to save humanity. Now, 500 years later, those same monsters have returned and it's up to a lone warrior, Raya, to track down the last dragon in order to finally stop the Druun for good. However, along her journey, she'll learn that it'll take more than dragon magic to save the world - it's going to take trust as well.", "filmName": "Raya and the Last Dragon", "releaseDate": "2021-03-05", "filmRating": "PG ", "filmID": 297864, "movieRating": "2.5/5", "movieGenre": "Animation", "movieRuntime": 114, "movieImage": "https://image.movieglu.com/297864/297864h1.jpg"}, {"filmSynop": "Hutch Mansell is an underestimated and overlooked dad and husband, takes life's indignities on the chin and never pushes back. A nobody.  When two thieves break into his suburban home one night, Hutch declines to defend himself or his family, hoping to prevent serious violence. His teenage son, Blake, is disappointed in him and his wife, Becca, seems to pull only further away. The aftermath of the incident strikes a match to Hutch's long-simmering rage, triggering dormant instincts and propelling him on a brutal path that will surface dark secrets and lethal skills. In a barrage of fists, gunfire and squealing tires, Hutch must save his family from a dangerous adversary and ensure that he will never be underestimated as a nobody again.", "filmName": "Nobody", "releaseDate": "2021-03-26", "filmRating": "R ", "filmID": 299585, "movieRating": "3/5", "movieGenre": "Action/Adventure", "movieRuntime": 92, "movieImage": "https://image.movieglu.com/299585/299585h1.jpg"}, {"filmSynop": "The Unholy follows Alice, a young hearing-impaired girl who, after a supposed visitation from the Virgin Mary, is inexplicably able to hear, speak and heal the sick. As word spreads and people from near and far flock to witness her miracles, a disgraced journalist (Jeffrey Dean Morgan) hoping to revive his career visits the small New England town to investigate. When terrifying events begin to happen all around, he starts to question if these phenomena are the works of the Virgin Mary or something much more sinister.", "filmName": "The Unholy", "releaseDate": "2021-04-02", "filmRating": "PG-13 ", "filmID": 317071, "movieRating": "0/5", "movieGenre": "Horror", "movieRuntime": 99, "movieImage": "https://image.movieglu.com/317071/317071h1.jpg"}, {"filmSynop": "When young loner Anna is hired as the gestational surrogate for Matt, a single man in his 40s who wants a child, the two strangers come to realize this unexpected relationship will quickly challenge their perceptions of connection, boundaries and the particulars of love.", "filmName": "Together Together", "releaseDate": "2021-04-23", "filmRating": "R ", "filmID": 315706, "movieRating": "3/5", "movieGenre": "Comedy", "movieRuntime": 90, "movieImage": "https://image.movieglu.com/315706/315706h1.jpg"}, {"filmSynop": "One of the most beloved rivalries in history is reignited when Jerry moves into New York City's finest hotel on the eve of the wedding of the century, forcing the event's desperate planner to hire Tom to get rid of him.The ensuing cat and mouse battle threatens to destroy her career, the wedding and possibly the hotel itself. But soon, an even bigger problem arises: a diabolically ambitious staffer conspiring against all three of them.", "filmName": "Tom & Jerry", "releaseDate": "2021-02-26", "filmRating": "PG ", "filmID": 289653, "movieRating": "0/5", "movieGenre": "Animation", "movieRuntime": 101, "movieImage": "https://image.movieglu.com/289653/289653h1.jpg"}, {"filmSynop": "Following the economic collapse of a company town in rural Nevada, Fern (Frances McDormand) packs her van and sets off on the road exploring a life outside of conventional society as a modern-day nomad. The third feature film from director Chloé Zhao, NOMADLAND features real nomads Linda May, Swankie and Bob Wells as Fern's mentors and comrades in her exploration through the vast landscape of the American West.", "filmName": "Nomadland", "releaseDate": "2021-02-19", "filmRating": "R ", "filmID": 287879, "movieRating": "3/5", "movieGenre": "Drama", "movieRuntime": 108, "movieImage": "https://image.movieglu.com/287879/287879h1.jpg"}]