[{"filmSynop": "As the Third Reich continues its reign of terror, Adolf Hitler is on a quest for the legendary Ark os the Covenenant- resting place of the Ten Commandments- whose supernatural powers, legend says, can wipe out entire armies.\n\nThe U.S. Government turns to Dr. Indiana Jones, for the mission.  Relentlessly pursued by Hitler's henchmen, Indy infiltrartes their massive digging operation in a race against time to discover the Well od the Souls, where the Ark has lain undisturbed for centuries.", "filmName": "Raiders of the Lost Ark", "releaseDate": "1992-07-01", "filmRating": "PG ", "filmID": 7772, "movieRating": "0/5", "movieGenre": "Action/Adventure", "movieRuntime": 105, "movieImage": "https://image.movieglu.com/7772/GBR_007772h0.jpg"}, {"filmSynop": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive. Millions of miles away, NASA and a team of international scientists work tirelessly to bring \"the Martian\" home, while his crewmates concurrently plot a daring, if not impossible, rescue mission. As these stories of incredible bravery unfold, the world comes together to root for Watney's safe return.", "filmName": "The Martian", "releaseDate": "2015-09-30", "filmRating": "12A ", "filmID": 184126, "movieRating": "3.5/5", "movieGenre": "Action/Adventure", "movieRuntime": 141, "movieImage": "https://image.movieglu.com/184126/GBR_184126h0.jpg"}, {"filmSynop": "Set on the incendiary frontier of California's turn-of-the-century petroleum boom, the story chronicles the rise of Daniel Plainview, who transforms himself from a down-and-out silver miner raising a son on his own into a self-made oil tycoon. When Plainview gets a mysterious tip that there's a little town out West where an ocean of oil is oozing out of the ground, he heads with his son, H.W., to take their chances in dust-worn Little Boston. In this hardscrabble town, where the main excitement centers around the holy-roller church of charismatic preacher Eli Sunday, Plainview and H.W. make their lucky strike. But even as the well raises all of their fortunes, nothing will remain the same as conflicts escalate and every human value--love, hope, community, belief, ambition and even the bond between father and son--is imperiled by corruption, deception and the flow of oil.", "filmName": "There Will Be Blood", "releaseDate": "2008-02-08", "filmRating": "15 ", "filmID": 59906, "movieRating": "4/5", "movieGenre": "Drama", "movieRuntime": 158, "movieImage": "https://image.movieglu.com/59906/059906h1.jpg"}, {"filmSynop": "In this action-horror flick from director Robert Rodriguez and screenwriter Quentin Tarantino, Tarantino stars with George Clooney as a pair of bad-to-the-bone brothers named Seth and Richie Gecko. After a string of robberies that left a river of blood in the Geckos' wake, the sadistic siblings head to Mexico to live the good life. To get over the border, they kidnap Jacob Fuller, a widowed preacher played by Harvey Keitel, and his two children, Kate (Juliette Lewis) and Scott (Ernest Liu). Once south of the border, the quintet park their RV at a rough-and-tumble trucker bar called The Titty Twister, where Seth and Richie are supposed to meet a local thug. After a couple of drinks, they realize that they're not in a typical bar, as the entire place begins to teem with vicious, blood-sucking vampires. With the odds stacked greatly against them, the Fullers and Geckos team together in hopes of defeating the creatures of the night. Makeup artist Tom Savini and blaxploitation star Fred Williamson appear as allies against the vampires, and Cheech Marin fills three different roles.~ Matthew Tobey, All Movie Guide", "filmName": "From Dusk Till Dawn", "releaseDate": "1996-05-09", "filmRating": "18 ", "filmID": 3427, "movieRating": "0/5", "movieGenre": "Suspense/Thriller", "movieRuntime": 100, "movieImage": "https://image.movieglu.com/3427/GBR_003427h0.jpg"}, {"filmSynop": "Two drag-queens, Mitzi and Felicia, and a transsexual, Bernadette sign up for a gig at a drag show in the remote Australian desert.They head west from Sydney aboard a lavender bus named Priscilla, but when they arrive, they find more than just a cabaret job lying in wait.", "filmName": "The Adventures of Priscilla, Queen of the Desert", "releaseDate": "2019-06-07", "filmRating": "15 ", "filmID": 1685, "movieRating": "0/5", "movieGenre": "Drama", "movieRuntime": 102, "movieImage": "https://image.movieglu.com/1685/GBR_001685h0.jpg"}]